read_verilog ./custom/verilog/fib.v
hierarchy -auto-top
flatten
proc
techmap
clean
dfflibmap -liberty ./custom/cells.lib
abc -liberty ./custom/cells.lib
clean
stat
write_json ./custom/out.json
