read_verilog -sv ./verilog/rule110.v
hierarchy -auto-top
flatten
proc
techmap
clean
dfflibmap -liberty ./yosys/grub/cells.lib
abc -liberty ./yosys/grub/cells.lib
clean
stat
write_json ./out.json
